<?php
namespace UnitTest\KR\OR\NHIS;

$BasePath = realpath("../../../../Tilko.API/../");
require_once($BasePath . "/UnitTest/Constant.php");
require_once($BasePath . "/Tilko.API/REST.php");
require_once($BasePath . "/Tilko.API/Models/Models.php");

use Tilko\API;
use UnitTest;

// API 상세설명 URL
// https://tilko.net/Help/Api/POST-api-apiVersion-Kcomwel-SamuChwideukSingo

try {
    $Constant = new \UnitTest\Constant;
    
    $Rest = new \Tilko\API\REST($Constant::ApiKey);
    $Rest->Init();
    
    // 고용산재토탈의 4대보험 취득신고 endPoint 설정
    $Rest->SetEndPointUrl($Constant::ApiHost . "api/v1.0/kcomwel/samuchwideuksingo");
    
    // 공동인증서 경로 설정
    $PublicPath = $Constant::CertPath . "/signCert.der";
    $PrivatePath = $Constant::CertPath . "/signPri.key";
    
    // Body 추가
    $Rest->AddBody("CertFile", file_get_contents($PublicPath), true);   // [암호화] 인증서 공개키
    $Rest->AddBody("KeyFile", file_get_contents($PrivatePath), true);   // [암호화] 인증서 개인키
    $Rest->AddBody("CertPassword", $Constant::CertPassword, true);      // [암호화] 인증서 암호
    $Rest->AddBody("BusinessNumber", "", true);                         // [암호화] 검색 할 사업자등록번호 또는 주민등록번호(xxxxxxxxxx 또는 xxxxxxxxxxxxx / Base64 인코딩)
    $Rest->AddBody("UserGroupFlag", "", false);                         // 인증서 - 사업장(0)/사무대행(1) 구분
    $Rest->AddBody("IndividualFlag", "", false);                        // 인증서 - 개인(0)/법인(1) 구분
    $Rest->AddBody("GwanriNo", "", false);                              // 관리번호
    $Rest->AddBody("GeunrojaRgNo", "", true);                           // [암호화]근로자 주민등록번호(xxxxxxxxxxxxx / Base64 인코딩)
    $Rest->AddBody("GeunrojaNm", "", false);                            // 근로자 성명
    $Rest->AddBody("JikJongCd", "", false);                             // 직종부호코드 - 의회의원고위공무원및기업고위임원(0)/행정경영금융보험관리자(1)/전문서비스관리자(2)/미용여행숙박음식경비청소관리자(3)/영업판매운송관리자(4)/건설채굴제조생산관리자(5)/정부공공행정전문가(6)/경영인사전문가(7)/회계세무감정전문가(8)/광고조사상품기획행사기획전문가(9)/정부공공행정사무원(10)/경영지원사무원(11)/회계경리사무원(12)/무역운송생산품질사무원(13)/안내고객상담통계비서사무보조및기타사무원(14)/금융보험전문가(15)/금융보험사무원(16)/금융보험영업원(17)/인문사회과학연구원(18)/자연과학연구원및시험원(19)/생명과학연구원및시험원(20)/컴퓨터하드웨어통신공학기술자(21)/컴퓨터시스템전문가(22)/소프트웨어개발자(23)/데이터네트워크및시스템운영전문가(24)/정보보안전문가(25)/통신방송송출장비기사(26)/건축토목공학기술자및시험원(27)/기계로봇공학기술자및시험원(28)/금속재료공학기술자및시험원(29)/전기전자공학기술자및시험원(30)/화학공학기술자및시험원(31)/에너지환경공학기술자및시험원(32)/섬유공학기술자및시험원(33)/식품공학기술자및시험원(34)/소방방재산업안전비파괴기술자(35)/제도사및기타인쇄목재등공학기술자및시험원(36)/대학교수및강사(37)/학교교사(38)/유치원교사(39)/문리기술예능강사(40)/장학관및기타교육종사자(41)/법률전문가(42)/법률사무원(43)/사회복지사및상담사(44)/보육교사및기타사회복지종사자(45)/성직자및기타종교종사자(46)/경찰관소방관및교도관(47)/군인(48)/의사한의사및치과의사(49)/수의사(50)/약사및한약사(51)/간호사(52)/영양사(53)/의료기사치료사재활사(54)/보건의료종사자(55)/작가통번역가(56)/기자및언론전문가(57)/학예사사서기록물관리사(58)/창작공연전문가작가연극제외(59)/디자이너(60)/연극영화방송전문가(61)/문화예술기획자및매니저(62)/스포츠레크리에이션종사자(63)/창작문학(64)/창작미술(65)/창작사진(66)/창작건축(67)/창작음악(68)/창작국악(69)/창작무용(70)/창작연극(71)/창작영화(72)/창작연예(73)/창작만화(74)/창작기타(75)/실연문학(76)/실연미술(77)/실연사진(78)/실연건축(79)/실연음악(80)/실연국악(81)/실연무용(82)/실연연극(83)/실연영화(84)/실연연예(85)/실연만화(86)/실연기타(87)/기술지원문학(88)/기술지원미술(89)/기술지원사진(90)/기술지원건축(91)/기술지원음악(92)/기술지원국악(93)/기술지원무용(94)/기술지원연극(95)/기술지원영화(96)/기술지원연예(97)/기술지원만화(98)/기술지원기타(99)/미용서비스원(100)/결혼장례등예식서비스원(101)/여행서비스원(102)/항공기선박열차객실승무원(103)/숙박시설서비스원(104)/오락시설서비스원(105)/주방장및조리사(106)/식당서비스원(107)/경호보안종사자(108)/경비원(109)/돌봄서비스종사자(110)/청소방역및가사서비스원(111)/검침주차관리및기타서비스단순종사자(112)/부동산컨설턴트및중개인(113)/영업원및상품중개인(114)/텔레마케터(115)/소규모상점경영및일선관리종사자(116)/판매종사자(117)/매장계산원및매표원(118)/판촉및기타판매단순종사자(119)/항공기선박철도조종사및관제사(120)/자동차운전원(121)/물품이동장비조작원크레인호이스트지게차(122)/택배원및기타운송종사자(123)/건설구조기능원(124)/건축마감기능원(125)/배관공(126)/건설채굴기계운전원(127)/기타건설기능원채굴포함(128)/건설채굴단순종사자(129)/기계정비설치정비원운송장비제외(130)/운송장비정비원(131)/금형원및공작기계조작원(132)/냉난방설비조작원(133)/자동조립라인산업용로봇조작원(134)/기계조립원운송장비제외(135)/운송장비조립원(136)/금속관련기계설비조작원(137)/판금원및제관원(138)/단조원및주조원(139)/용접원(140)/동장원및도금원(141)/비금속제품생산기계조작원(142)/전기공(143)/전기전자기기설치수리원(144)/발전배전장치조작원(145)/전기전자설비조작원(146)/전기전자부품제품생산기계조작원(147)/전기전자부품제품조립원(148)/정보통신기기설치수리원(149)/방송통신장비설치수리원(150)/석유화학물가공장치조작원(151)/고무플라스틱및화학제품생산기계조작원및조립원(152)/환경관련장치조작원(153)/섬유제조가공기계조작원(154)/패턴사재단사및재봉사(155)/의복제조원및수선원(156)/제화원기타섬유의복기계조작원및조립원(157)/제과제빵원및떡제조원(158)/식품가공기능원(159)/식품가공기계조작원(160)/인쇄기계사진현상기조작원(161)/목재펄프종이생산기계조작원(162)/가구목제품제조수리원(163)/공예원및귀금속세공원(164)/악기간판및시타제조종사자(165)/제조단순종사자(166)/작물재배종사자(167)/낙농사육종사자(168)/임업종사자(169)/어업종사자(170)/농림어업단순종사자(171)/보험설계사생명보험사소속(172)/보험설계사생명보험사외소속(173)/학습지방문강사교육교구강사(174)/택배기사(175)/대출모집인대출여신금융기관소속(176)/대출모집인대출모집법인소속(177)/신용카드회원모집인(178)/방문판매원후원방문판매원(179)/대여제품방문점검원(180)/가전제품배송기사(181)/방과후강사(182)/건설기계조종사(183)/화물차주시멘트운송(184)/화물차주철강재운송(185)/화물차주위험물질운송(186)/화물차주수출입컨테이너(187)
    $Rest->AddBody("ChwideukMMNapbuYN", "", false);                     // 취득월납부여부(Y/N)
    $Rest->AddBody("GyeYakJikYN", "", false);                           // 계약직여부(Y/N) 
    $Rest->AddBody("ChwideukDt", "", false);                            // 취득일자(YYYYMMDD)
    $Rest->AddBody("JuSojeongGeunroTm", "", false);                     // 1주소정근로시간
    $Rest->AddBody("MmAvgBosu", "", false);                             // 월평균보수(원)
    $Rest->AddBody("NPSChwideukBuho", "", false);                       // 국민연금 취득 부호 - 십팔세이상당연취득(0)/십팔세미만취득(1)/전입사업장통폐합(2)/대학강사(3)/육십시간미만신청취득(4)
    $Rest->AddBody("NHICChwideukBuho", "", false);                      // 건강보험 취득 부호 - 최초취득(0)/의료급여수급권자해제(1)/직장가입자변경(2)/직장피부양자상실(3)/지역가입자에서변경(4)/국가유공자상실(5)/기타(6)/직권말소후재등록(7)/직장가입자이중가입(8)
    $Rest->AddBody("GYBYN", "", false);                                 // 고용보험 여부(Y/N)
    $Rest->AddBody("NHICYN", "", false);                                // 건강보험 여부(Y/N)
    $Rest->AddBody("NPSYN", "", false);                                 // 국민연금 여부(Y/N)
    $Rest->AddBody("SJBYN", "", false);                                 // 산재보험 여부(Y/N)
    $Rest->AddBody("ILJARIYN", "", false);                              // 일자리신청여부(Y/N)
    $Rest->AddBody("GyeyakToDt", "", false);                            // 계약종료년월(YYYYMM)
    $Rest->AddBody("GukJeok", "", false);                               // 국적 - 미상(0)/한국(1)/아프가니스탄(2)/바레인(3)/방글라데시(4)/부탄(5)/브루나이(6)/미얀마(7)/영령인도양섬(8)/캄보디아(9)/스리랑카(10)/중국(11)/타이완(12)/키프로스(13)/북한(14)/홍콩(15)/홍콩거주난민(16)/한국계중국인(17)/인도(18)/인도네시아(19)/이란(20)/이라크(21)/이스라엘(22)/일본(23)/요르단(24)/카자흐스탄(25)/키르기스스탄(26)/쿠웨이트(27)/라오스(28)/레바논(29)/마카오(30)/말레이시아(31)/몰디브(32)/몽골(33)/마요트(34)/네팔(35)/오만(36)/파키스탄(37)/팔레스타인(38)/필리핀(39)/티모르(40)/카타르(41)/사우디아라비아(42)/시킴왕국(43)/싱가포르(44)/시리아(45)/타이(46)/터키(47)/투르크메이스탄(48)/아랍에미리트연합(49)/우즈베키스탄(50)/베트남(51)/예멘공화국(52)/예멘인민민주공화국(53)/앵귈라(54)/앤티가바부다(55)/아르헨티나(56)/아루바(57)/바하마(58)/바에이도스(59)/벨리즈(60)/볼리비아(61)/브라질(62)/버뮤다(63)/부베트(64)/케이맨제도(65)/캐나다(66)/칠레(67)/콜롬비아(68)/코스타리카(69)/쿠바(70)/도미니카연방(71)/도미니카공화국(72)/이스터제도(73)/에콰도르(74)/엘살바도르(75)/포클랜드(76)/불령가이아나(77)/그레나다(78)/과들루프(79)/과테말라(80)/가이아나(81)/아이티(82)/온두라스(83)/자메이카(84)/마르티니크(85)/멕시코(86)/몬서래트(87)/네덜란드령앤틸리스(88)/니카라과(89)/파나마(90)/파라과이(91)/페루(92)/푸에르토리코(93)/남조지아남샌드위치군도(94)/상피에르미클롱(95)/세인트크리스토퍼네비스(96)/세인트루시아(97)/세인트빈센트그레나딘(98)/수리남(99)/트리니다드토바고(100)/터크스케이커스(101)/우루과이(102)/미국(103)/미국인근섬(104)/베네수엘라(105)/미령버진아일랜드(106)/영령버진아일랜드(107)/알바니아(108)/안도라(109)/아르메니아(110)/아제르바이잔(111)/벨기에(112)/불가리아(113)/벨로루시(114)/보스니아헤르체고비나(115)/체코(116)/페로섬(117)/에스토니아(118)/덴마크(119)/영국보호민(120)/영국속국민(121)/영국(122)/영국속령지시민(123)/영국외지민(124)/영국외지시민(125)/핀란드(126)/프랑스(127)/한국계러시아인(128)/그루지야(129)/독일(130)/동독(131)/그리스(132)/지브롤터(133)/그린란드(134)/헝가리(135)/아이슬란드(136)/아일랜드(137)/이탈리아(138)/코소보(139)/라트비아(140)/리히텐슈타인(141)/룩셈부르크(142)/리투아니아(143)/마케도니아(144)/몰타(145)/모나코(146)/몰도바(147)/몬테네그로(148)/네덜란드(149)/노르웨이(150)/폴란드(151)/포르투갈(152)/루마니아(153)/러시아연방(154)/세르비아(155)/슬로바크(156)/슬로베니아(157)/산마리노(158)/스페인(159)/스웨덴(160)/스위스(161)/스발바르(162)/우크라이나(163)/독립국가연합(164)/바티칸(165)/유고슬라비아(166)/세르비아몬테네그로(167)/오스트레일리아(168)/캐롤라인군도(169)/쿡아일랜드(170)/크리스마스(171)/코코스(172)/피지(173)/불령폴리네시아(174)/불령남태평양섬(175)/괌(176)/허드맥도날드(177)/키리바시(178)/북마리아나군도(179)/미크로네시아(180)/마라아나군도(181)/마샬군도(182)/미드웨이(183)/나우루(184)/뉴칼레도니아(185)/뉴질랜드(186)/니우에(187)/노퍽(188)/팔라우(189)/파푸아뉴기니(190)/핏캐론(191)/사모아(192)/미령사모아(193)/솔로몬군도(194)/호주령솔로몬군도(195)/통가(196)/토켈라우(197)/투발루(198)/비누아투(199)/웨이크아일랜드(200)/월리스푸투나(201)/알제리(202)/앙골라(203)/보츠와나(204)/부룬디(205)/카메론(206)/카나리아군도(207)/카보베르데(208)/중앙아프리카공화국(209)/차드(210)/코모로(211)/콩고(212)/콩고민주공화국(213)/베냉(214)/지부티(215)/이집트(216)/적도기니(217)/에티오피아(218)/에리트레아(219)/가봉(220)/감비아(221)/가나(222)/기니(223)/기니비사우(224)/코트디부아르(225)/케냐(226)/레소토(227)/라이베리아(228)/리비아(229)/마다가스카르(230)/말라위(231)/말리(232)/모리타니(233)/모리셔스(234)/모로코(235)/모잠비크(236)/나미비아(237)/니제르(238)/나이지리아(239)/레위니옹(240)/짐바브웨(241)/르완다(242)/상투메프린시페(243)/세네갈(244)/세이셸(245)/시에라리온(246)/소말리아(247)/남아프리카공화국(248)/세인트헬레나(249)/수단(250)/스와질란드(251)/탄자니아(252)/토고(253)/튀니지(254)/우간다(255)/부르키나파소(256)/서사하라(257)/자이르(258)/잠비아(259)/무국적(260)/남극대륙(261)/공해(262)/이중국적(263)/한국재외국민(264)/난민(265)/국제연합(266)
   
    // API 호출
    define("Response", $Rest->Call());
    print("Response: " . Response);
}
catch (\Exception $e)
{
    print($e->getMessage());
}
?>
